Autodesk.Revit.DB.MEPAnalyticalConnectionType.FindTypeByName(Autodesk.Revit.DB.Document,System.String)
Finds the analytical connection type by its name.
doc:
The document where the analytical conneciton type is expected.
name:
The name of the expected analytical connection type.
Returns:
The element id of matched analytical connection type, otherwise invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.MEPAnalyticalConnectionType.IsNameUnused(Autodesk.Revit.DB.Document,System.String)
Checks if this is an unused name.
doc:
The document.
name:
The name to be verified.
Returns:
True if not used by an existing analytical connection type in this document, false if used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.MEPAnalyticalConnectionType.Create(Autodesk.Revit.DB.Document,System.String)
Creates an analytical connection type element.
Remarks:
The newly created type would have the default pressure loss being 0.
Use ElementType.duplicate to copy from any existing type.
doc:
The document.
name:
The name of the analytical type to be created.
Returns:
The created analytical connection type element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This name is already used by an existing analytical connection type in the document.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018